In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
# Video 18 done

In [4]:
# PANDAS SERIES

In [5]:
pd.__version__ # check version

'1.2.4'

In [6]:
list_s = [1,2, -3, 6.2,'data values']
print(list_s)

[1, 2, -3, 6.2, 'data values']

In [7]:
series1 = pd.Series(list_s) # create series
print(series1)

0              1
1              2
2             -3
3            6.2
4    data values
dtype: object

In [8]:
type(series1) # check type

pandas.core.series.Series

In [9]:
series2 = pd.Series([1,2,3,4]) # create series on short way
print(series2)

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
empty_s = pd.Series([]) # create empty series
print(empty_s)

Series([], dtype: float64)

<ipython-input-10-22accf230ce3>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty_s = pd.Series([]) # create empty series

In [11]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d']) # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype= float) # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [13]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype= float,name = 'data values') # create series on short way with custom index. valu and index allwage should be equel
print(series3)

a    1.0
b    2.0
c    3.0
d    4.0
Name: data values, dtype: float64

In [14]:
scalear_s = pd.Series(0.5)
print(scalear_s)

0    0.5
dtype: float64

In [15]:
scalear_s = pd.Series(0.5, index=[1,2,3])
print(scalear_s)

1    0.5
2    0.5
3    0.5
dtype: float64

In [16]:
dict_s = pd.Series({'a' : 1, 'b': 2})
print(dict_s)

a    1
b    2
dtype: int64

In [17]:
s4 = pd.Series([1,2,3,4,5])
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
s4[0]

1

In [19]:
s4[3]

4

In [20]:
s4[0:3] # sliceing

0    1
1    2
2    3
dtype: int64

In [21]:
max(s4) # findoout max valu

5

In [22]:
min(s4) # find out min valu

1

In [23]:
s4[ s4 > 3 ] # find valu getter then 3

3    4
4    5
dtype: int64

In [24]:
s4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
s5 = pd.Series([1,2,3,4,5])
print(s5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
print(s4)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
s4 + s5

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [28]:
s6 = pd.Series([1,2,3])
print(s6)

0    1
1    2
2    3
dtype: int64

In [29]:
s5 + s6

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [30]:
# VIDEO 19 DONE

In [31]:
# PANDAS DATAFRAME

In [32]:
emt_df = pd.DataFrame() # Create empty dataframe
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [33]:
lst = ['a','b','c'] # Create list
print(lst)

['a', 'b', 'c']

In [34]:
df1 = pd.DataFrame(lst) # Create dataFrame from list
print(df1)

   0
0  a
1  b
2  c

In [35]:
df1

   0
0  a
1  b
2  c

In [36]:
ls_of_ls = [ [1,2,3],[2,3,4],[4,5,6] ]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [37]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [38]:
dict1 = {'ID' : [11,22,33,44]}
dict1

{'ID': [11, 22, 33, 44]}

In [39]:
df3 = pd.DataFrame(dict1) # create data frame use dicnarry
df3

   ID
0  11
1  22
2  33
3  44

In [40]:
dict1 = {'ID' : [11,22,33,44], 'SA' : [1,2,3,4]}
dict1

{'ID': [11, 22, 33, 44], 'SA': [1, 2, 3, 4]}

In [41]:
df3 = pd.DataFrame(dict1)
df3

   ID  SA
0  11   1
1  22   2
2  33   3
3  44   4

In [42]:
ls_dict = [{'a' : 1, 'b' : 2}, {'a': 3,'b': 4}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [43]:
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [44]:
ls_dict = [{'a' : 1, 'b' : 2}, {'a': 3,'b': 4, 'c' : 5}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [45]:
dict_sr = {'id' : pd.Series([1,2,3]), 'sa' : pd.Series([111,222,333])} # Create dataframe use dic of Series
df6 = pd.DataFrame(dict_sr)
df6

   id   sa
0   1  111
1   2  222
2   3  333

In [46]:
# VIDEO 20 DONE

In [47]:
# HOW TO READ CSV FILE IN PANDAS

In [48]:
pd.read_csv('Student_1.csv')

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [49]:
pd.read_csv('Top_10_it.csv')

  Top 10 IT Companies in india
0                          TCS
1                      Infosys
2                Tech Mahindra
3                        Wipro
4             HCL Technologies
5                 L&T Infotech
6                     Mindtree
7                      Mphasis
8    Oracle Financial Services
9                  Rotla India

In [50]:
import os

In [51]:
print(os.getcwd()) # to show our working dic

i:\All Gide Bank\ARTIFICIAL_INTELLIGENCE_Gide_Bank\MACHINE_LEARNING_GIDE_BANK\PANDAS

In [52]:
# VIDEO 21 DONE

In [53]:
# HOW TO WRITE CSV FILE IN PANDAS

In [54]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [55]:
type(df) # to chack type

pandas.core.frame.DataFrame

In [56]:
df.columns # print colum name

Index(['ID', 'Name', 'Industry', 'Inception', 'Revenue', 'Expenses', 'Profit',
       'Growth'],
      dtype='object')

In [57]:
df = pd.read_csv('Fortune_10.csv', nrows= 1 ) # print spacipic row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [58]:
df = pd.read_csv('Fortune_10.csv', nrows= 5 ) # print 5 row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%

In [59]:
df = pd.read_csv('Fortune_10.csv', usecols= [0] ) # print spacipic col / valu will be on list
df

   ID
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [60]:
df = pd.read_csv('Fortune_10.csv', usecols= [0,1] ) # print spacipic col / valu will be on list
df

   ID             Name
0   1          Lamtone
1   2        Stripfind
2   3  Canecorporation
3   4         Mattouch
4   5        Techdrill
5   6         Techline
6   7          Cityace
7   8   Kayelectronics
8   9          Ganzlax
9  10      Trantraxlax

In [61]:
df = pd.read_csv('Fortune_10.csv', usecols= [2,4,7] ) # print importent col / valu will be on list
df

              Industry       Revenue Growth
0          IT Services  $11,757,018     30%
1   Financial Services  $11,757,018     20%
2               Health  $11,757,018      7%
3          IT Services  $11,757,018     26%
4               Health  $11,757,018      8%
5               Health  $11,757,018     23%
6               Health  $11,757,018      6%
7               Health  $11,757,018      4%
8          IT Services  $11,757,018     18%
9  Government Services  $11,757,018      7%

In [62]:
df = pd.read_csv('Fortune_11.csv') # on this file first row is heading
df

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [63]:
df = pd.read_csv('Fortune_11.csv',skiprows= 1) # to skip 1st row
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [64]:
df = pd.read_csv('Fortune_11.csv',skiprows= 2) # to skip 2 row
df

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
1,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
2,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
3,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
4,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
5,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
6,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
7,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
8,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [65]:
df = pd.read_csv('Fortune_11.csv',skiprows= [0])  # skip use index
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [66]:
df = pd.read_csv('Fortune_11.csv',skiprows= [2])  # skip use index
df

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [67]:
df = pd.read_csv('Fortune_11.csv',skiprows= [1,2,3])  # skip multi row use index
df

,0,1,2,3,4,5,6,7
0,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
1,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
2,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
3,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
4,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
5,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
6,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
7,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [68]:
df = pd.read_csv('Fortune_10.csv')  
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [69]:
df = pd.read_csv('Fortune_10.csv',index_col='ID')   # chenge index
df

,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
ID,,,,,,,
1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [70]:
df = pd.read_csv('Fortune_10.csv',index_col='Name')   # make name into index
df

,ID,Industry,Inception,Revenue,Expenses,Profit,Growth
Name,,,,,,,
Lamtone,1,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
Stripfind,2,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
Canecorporation,3,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
Mattouch,4,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
Techdrill,5,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
Techline,6,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
Cityace,7,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
Kayelectronics,8,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
Ganzlax,9,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
Trantraxlax,10,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [71]:
df = pd.read_csv('Fortune_10.csv',index_col= 2)   # chenge index in industy
df

,ID,Name,Inception,Revenue,Expenses,Profit,Growth
Industry,,,,,,,
IT Services,1,Lamtone,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
Financial Services,2,Stripfind,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
Health,3,Canecorporation,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
IT Services,4,Mattouch,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
Health,5,Techdrill,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
Health,6,Techline,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
Health,7,Cityace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
Health,8,Kayelectronics,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
IT Services,9,Ganzlax,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
Government Services,10,Trantraxlax,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [72]:
# VIDEO 22 DONE

In [73]:
# HOW TO WRITE CSV FILE

In [74]:
pd.read_csv('Fortune_11.csv', )

,0,1,2,3,4,5,6,7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [75]:
pd.read_csv('Fortune_11.csv', header=1) # make 1 index to header

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [76]:
pd.read_csv('Fortune_12.csv', ) # colam will show unnamed becouse col name is not set

,Unnamed: 0,Data,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
1,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
2,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
3,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
4,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
5,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
6,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
7,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
8,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
9,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
10,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [77]:
pd.read_csv('Fortune_12.csv', header=1)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [78]:
pd.read_csv('Fortune_13.csv') #  There is no header on this file

,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
0,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
1,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
2,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
3,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
4,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
5,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
6,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
7,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
8,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [79]:
pd.read_csv('Fortune_13.csv', header= None) # if header is not avable avable than use header is none

,0,1,2,3,4,5,6,7
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [80]:
pd.read_csv('Fortune_13.csv', header= None, prefix= 'Columns') # make custop header

,Columns0,Columns1,Columns2,Columns3,Columns4,Columns5,Columns6,Columns7
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [81]:
pd.read_csv('Fortune_13.csv', names=['A','B','C','D','E','F','G','H']) # make custom heading for every colom

,A,B,C,D,E,F,G,H
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [82]:
pd.read_csv('Fortune_13.csv', names=['ID','Name','Industry','Inception','Revenue','Expenses','Profit','Growth']) # make custom heading for every colom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [83]:
# VIDEO 23 DONE

In [84]:
# HOW TO WRITE CSV FILE IN PANDAS

In [85]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [86]:
df.head() # print first 5 row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%

In [87]:
df.head(1) # frint only 1 row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [88]:
df.head(8) # frint only 8 row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%

In [89]:
df.tail() # print 5 row from bottom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [90]:
df.tail(2) # print 2 row from bottom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [91]:
df.tail(7) # print 7 row from bottom

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [92]:
df = pd.read_csv('Fortune_10.csv', dtype= {'ID': 'float64'}) # change first ID colum from int to str
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2.0,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3.0,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4.0,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5.0,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6.0,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7.0,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8.0,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9.0,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10.0,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [93]:
df = pd.read_csv('Fortune_10.csv', dtype= {'ID': 'float64','Profit' : 'float64'}) # change first ID & Profit colum from int to str
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553.0,30%
1,2.0,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553.0,20%
2,3.0,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553.0,7%
3,4.0,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553.0,26%
4,5.0,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553.0,8%
5,6.0,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553.0,23%
6,7.0,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553.0,6%
7,8.0,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553.0,4%
8,9.0,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553.0,18%
9,10.0,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553.0,7%

In [94]:
df = pd.read_csv('Fortune_14.csv') 
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,No,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,No,Yes,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,No,Yes,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,No,Yes,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,No,Yes,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,No,Yes,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,No,Yes,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,No,Yes,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,No,Yes,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,No,Yes,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [95]:
df = pd.read_csv('Fortune_14.csv',true_values=['Yes'])  # where is yes there is true
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,No,True,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,No,True,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,No,True,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,No,True,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,No,True,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,No,True,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,No,True,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,No,True,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,No,True,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,No,True,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [96]:
df = pd.read_csv('Fortune_14.csv')
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,No,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,No,Yes,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,No,Yes,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,No,Yes,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,No,Yes,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,No,Yes,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,No,Yes,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,No,Yes,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,No,Yes,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,No,Yes,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [97]:
df = pd.read_csv('Fortune_14.csv',true_values=['Yes'], false_values= ['No'])  # where is yes there is true and where is No there is false
df

,ID,Date No,Date Yes,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,False,True,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,False,True,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,False,True,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,False,True,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,False,True,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,False,True,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,False,True,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,False,True,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,False,True,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,False,True,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [98]:
# VIDEO 24 DONE

In [99]:
# HANDLING MISSING VALUES

In [100]:
#     NaN = #N/A, #N/A N/A, #NA, -1.#IND, -1.#QNAN, -NnN, -nan, N/A, NA, NULL, null, n/a, nan, 1.#IND, 1.#QNAN

In [101]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [102]:
df = pd.read_csv('Fortune_15.csv', na_values= 'not available') # not avable avable will be NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,NaN
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,NaN
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [103]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [104]:
df = pd.read_csv('Fortune_15.csv', na_values= ['not available','yyy']) # not avable avable & yyy will be NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,NaN
4,5,NaN,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,NaN
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,NaN,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [105]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [106]:
df = pd.read_csv('Fortune_15.csv',na_values={'Growth':'not available'}) # make custom nan valu use colum
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,NaN
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,NaN
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [107]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [108]:
df = pd.read_csv('Fortune_15.csv',keep_default_na=False) # keep default valu do not show NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,,2006,"$11,757,018","6,482,465 Dollars",5274553,
6,7,Cityace,,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [109]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [110]:
df = pd.read_csv('Fortune_10.csv',na_filter=False) # it will not check messing valu or null valu tha's wht speed will boost
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [111]:
# VIDEO 25 DONE

In [112]:
# HANDLING MISSING VALUES

In [113]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [114]:
df.isnull() # to chack null valu

      ID   Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  False  False     False      False    False     False   False   False
1  False  False     False      False    False     False   False   False
2  False  False     False      False    False     False   False   False
3  False  False     False      False    False     False   False   False
4  False  False      True      False    False     False   False   False
5  False  False      True      False    False     False   False    True
6  False  False      True      False    False     False   False   False
7  False  False      True      False    False     False   False   False
8  False  False     False      False    False     False   False   False
9  False  False     False      False    False     False   False   False

In [115]:
df.isnull().sum() # to show null valu use col

ID           0
Name         0
Industry     4
Inception    0
Revenue      0
Expenses     0
Profit       0
Growth       1
dtype: int64

In [116]:
df.isnull().sum().sum() # To show total null valu

5

In [117]:
df.notnull()

     ID  Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  True  True      True       True     True      True    True    True
1  True  True      True       True     True      True    True    True
2  True  True      True       True     True      True    True    True
3  True  True      True       True     True      True    True    True
4  True  True     False       True     True      True    True    True
5  True  True     False       True     True      True    True   False
6  True  True     False       True     True      True    True    True
7  True  True     False       True     True      True    True    True
8  True  True      True       True     True      True    True    True
9  True  True      True       True     True      True    True    True

In [118]:
df.notnull().sum()

ID           10
Name         10
Industry      6
Inception    10
Revenue      10
Expenses     10
Profit       10
Growth        9
dtype: int64

In [119]:
df.notnull().sum().sum() # Total 75 valu is not null

75

In [120]:
# SERIES

In [121]:
import numpy as np
sr = pd.Series([1,2,3,np.nan,4,np.NAN]) # np.nan,np.NAN = NaN
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [122]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [123]:
sr.isnull().sum()

2

In [124]:
# VIDEO 26 DONE

In [125]:
# HANDLING MISSING VALUES

In [126]:
df = pd.read_csv('Fortune_15.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [127]:
df.dropna() # delete the row which have null valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [128]:
df.dropna(axis= 1) # delete the col which have null valu

   ID             Name  Inception       Revenue           Expenses   Profit
0   1          Lamtone       2009  $11,757,018   6,482,465 Dollars  5274553
1   2        Stripfind       2010  $11,757,018   6,482,465 Dollars  5274553
2   3  Canecorporation       2012  $11,757,018   6,482,465 Dollars  5274553
3   4         Mattouch       2013  $11,757,018   6,482,465 Dollars  5274553
4   5              yyy       2009  $11,757,018   6,482,465 Dollars  5274553
5   6         Techline       2006  $11,757,018   6,482,465 Dollars  5274553
6   7          Cityace       2010  $11,757,018   6,482,465 Dollars  5274553
7   8   Kayelectronics       2009  $11,757,018   6,482,465 Dollars  5274553
8   9          Ganzlax       2011  $11,757,018   6,482,465 Dollars  5274553
9  10              yyy       2011  $11,757,018   6,482,465 Dollars  5274553

In [129]:
df.dropna(how='any') # delete the row which has null valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [130]:
df.dropna(how='any',axis=1) # delete the col which has null valu

   ID             Name  Inception       Revenue           Expenses   Profit
0   1          Lamtone       2009  $11,757,018   6,482,465 Dollars  5274553
1   2        Stripfind       2010  $11,757,018   6,482,465 Dollars  5274553
2   3  Canecorporation       2012  $11,757,018   6,482,465 Dollars  5274553
3   4         Mattouch       2013  $11,757,018   6,482,465 Dollars  5274553
4   5              yyy       2009  $11,757,018   6,482,465 Dollars  5274553
5   6         Techline       2006  $11,757,018   6,482,465 Dollars  5274553
6   7          Cityace       2010  $11,757,018   6,482,465 Dollars  5274553
7   8   Kayelectronics       2009  $11,757,018   6,482,465 Dollars  5274553
8   9          Ganzlax       2011  $11,757,018   6,482,465 Dollars  5274553
9  10              yyy       2011  $11,757,018   6,482,465 Dollars  5274553

In [131]:
df.dropna(how='all') # if every row is nan than it will delete the row

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [132]:
df.dropna(thresh= 1) # Print those row whis has minimum 1 not null(true) valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [133]:
df.dropna(subset=['Industry']) # delete the row from industry col whics has null valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [134]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [135]:
df.dropna(inplace=True) # delete the row whics have null valu but it is not create a nuw dataFrame it is updateing the exdastaing  data Frame
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [136]:
# Video 27 done

In [137]:
# WHAT IS PANDAS FILLNA ? fillina fills the NaN values with given values(input)

In [138]:
df = pd.read_csv('Fortune_15.csv') # on missing valu show NaN
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [139]:
df.fillna(0) # where is NaN thare is 0

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,0,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,0,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,0,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [140]:
df.fillna(2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,2,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,2,2006,"$11,757,018","6,482,465 Dollars",5274553,2
6,7,Cityace,2,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,2,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [141]:
df.fillna({'Industry' : 'none', 'Growth' : '0'}) # colame wige nan valu change

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,none,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,none,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,none,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,none,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [142]:
df.fillna(method='ffill')  # ffill means feveus fill, where is nan valu there is feveus valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [143]:
df.fillna(method='pad') # ffill means feveus fill, where is nan valu there is feveus valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [144]:
df.fillna(method='bfill') # bfill means backward fill, it will fill nan valu from backward valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,6%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [145]:
df.fillna(axis= 0, method='ffill')

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [146]:
df.fillna(axis= 1, method='ffill')

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,yyy,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Techline,2006,"$11,757,018","6,482,465 Dollars",5274553,5274553
6,7,Cityace,Cityace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Kayelectronics,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [147]:
df.fillna(axis= 1, method='bfill')

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,2009,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,2006,2006,"$11,757,018","6,482,465 Dollars",5274553,NaN
6,7,Cityace,2010,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,2009,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [148]:
df.fillna(0,limit = 1) # fill one 1 nan valu to 0

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,NaN,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [149]:
df.fillna(0,limit = 2) # fill one 1 nan valu to 2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,0,2006,"$11,757,018","6,482,465 Dollars",5274553,0
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [150]:
df.fillna(method='ffill',limit = 2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,8%
6,7,Cityace,NaN,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,NaN,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [151]:
df.fillna(5, inplace=True) # do not make a new dataframe
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,5,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,5,2006,"$11,757,018","6,482,465 Dollars",5274553,5
6,7,Cityace,5,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,5,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [152]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,not available
4,5,yyy,5,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,5,2006,"$11,757,018","6,482,465 Dollars",5274553,5
6,7,Cityace,5,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,5,2009,"$11,757,018","6,482,465 Dollars",5274553,not available
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,yyy,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [153]:
# video 28 done

In [154]:
# PANDAS REPLACE()
# Syntax : DataFrame.replace()

'''
Parameters : 
to_replace
limit
value
regex
inplace
method
'''

'\nParameters : \nto_replace\nlimit\nvalue\nregex\ninplace\nmethod\n'

In [155]:
df = pd.read_csv('Fortune_10.csv')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [156]:
df.replace(to_replace='Health', value='Finace') # where is health there is finace

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Finace,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Finace,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Finace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [157]:
df.replace('Health', 'Finace') # where is health there is finace use sotcut

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Finace,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Finace,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Finace,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Finace,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [158]:
df.replace(10,15) # wher is 10 there is 15

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,15,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [159]:
df.replace([1,2,3,4,5,6,7,8,9,10], 0)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,0,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,0,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,0,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,0,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,0,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,0,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,0,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,0,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,0,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [160]:
df.replace([1,2,3,4,5,6,7,8,9,10], [11,22,33,44,55,66,77,88,99,100])

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,11,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,22,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,33,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,44,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,55,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,66,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,77,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,88,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,99,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,100,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [161]:
df.replace({'Industry' : 'Health'}, 'None') # where is health there will be none on industry col

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,None,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,None,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,None,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,None,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,None,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [162]:
df.replace('[A-Z a-z]', 0) # NOTHING WILL HAPPAND

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [163]:
df.replace('[A-Z a-z]', 0,regex= True) # every string valu change to 0

   ID  Name  Industry  Inception  Revenue  Expenses   Profit Growth
0   1     0         0       2009        0         0  5274553    30%
1   2     0         0       2010        0         0  5274553    20%
2   3     0         0       2012        0         0  5274553     7%
3   4     0         0       2013        0         0  5274553    26%
4   5     0         0       2009        0         0  5274553     8%
5   6     0         0       2006        0         0  5274553    23%
6   7     0         0       2010        0         0  5274553     6%
7   8     0         0       2009        0         0  5274553     4%
8   9     0         0       2011        0         0  5274553    18%
9  10     0         0       2011        0         0  5274553     7%

In [164]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [165]:
df.replace({'Industry' : '[A-Za-z]'}, 0 , regex= True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,0,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,0,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,0,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,0,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,0,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,0,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,0,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,0,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,0,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,0,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [166]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [167]:
df.replace('Health',method='ffill') # where is health there will fill by foraword valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Financial Services,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [168]:
df.replace('Health',method='bfill') # where is health there will fill by backward valu

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,IT Services,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,IT Services,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [169]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [170]:
df.replace('Health',method= 'bfill',limit= 2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,IT Services,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,IT Services,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [171]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,Health,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,Health,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,Health,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,Health,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [172]:
df.replace('Health', 100,inplace= True) # do not make new data frame

In [173]:
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$11,757,018","6,482,465 Dollars",5274553,20%
2,3,Canecorporation,100,2012,"$11,757,018","6,482,465 Dollars",5274553,7%
3,4,Mattouch,IT Services,2013,"$11,757,018","6,482,465 Dollars",5274553,26%
4,5,Techdrill,100,2009,"$11,757,018","6,482,465 Dollars",5274553,8%
5,6,Techline,100,2006,"$11,757,018","6,482,465 Dollars",5274553,23%
6,7,Cityace,100,2010,"$11,757,018","6,482,465 Dollars",5274553,6%
7,8,Kayelectronics,100,2009,"$11,757,018","6,482,465 Dollars",5274553,4%
8,9,Ganzlax,IT Services,2011,"$11,757,018","6,482,465 Dollars",5274553,18%
9,10,Trantraxlax,Government Services,2011,"$11,757,018","6,482,465 Dollars",5274553,7%

In [174]:
#Video 29 done

In [175]:
# Pandas interpolate()

In [176]:
'''
Syntax : DataFrame.interpolate()
Series.interpolate()


Parameters : method inplace
axis limit_direction
limit limit_area

'''

'\nSyntax : DataFrame.interpolate()\nSeries.interpolate()\n\n\nParameters : method inplace\naxis limit_direction\nlimit limit_area\n\n'

In [177]:
df = pd.read_csv('Student_2.csv')
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [178]:
df.interpolate() # it will try to gras the number and fill the nan valu only newmaric valu

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [179]:
df.interpolate(method= 'linear') # linear is the defolt valu

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [180]:
df.interpolate(method= 'time') # it will show the error

ValueError: time-weighted interpolation only works on Series or DataFrames with a DatetimeIndex

In [ ]:
type(df.Date[0])

str

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'])
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,2019-01-07,10,2.0,9.0,3,5,50.0
1,2019-02-07,10,6.0,NaN,4,0,NaN
2,2019-03-07,10,3.0,8.0,4,4,NaN
3,2019-04-07,11,NaN,10.0,1,5,NaN
4,2019-05-07,11,4.0,7.0,2,0,75.0
5,2019-06-07,11,NaN,7.0,0,0,96.0
6,2019-07-07,12,4.0,NaN,0,0,80.0
7,2019-08-07,12,10.0,6.0,2,0,90.0
8,2019-09-07,12,2.0,8.0,2,4,60.0
9,2019-10-07,12,6.0,9.0,1,0,85.0

In [ ]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'], index_col= 'Date')
df

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.0,9.0,3,5,50.0
2019-02-07,10,6.0,NaN,4,0,NaN
2019-03-07,10,3.0,8.0,4,4,NaN
2019-04-07,11,NaN,10.0,1,5,NaN
2019-05-07,11,4.0,7.0,2,0,75.0
2019-06-07,11,NaN,7.0,0,0,96.0
2019-07-07,12,4.0,NaN,0,0,80.0
2019-08-07,12,10.0,6.0,2,0,90.0
2019-09-07,12,2.0,8.0,2,4,60.0
2019-10-07,12,6.0,9.0,1,0,85.0

In [ ]:
df.interpolate(method='time') # now error will not show //// gess the nan valu use the time

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.000000,9.000000,3,5,50.000000
2019-02-07,10,6.000000,8.474576,4,0,56.458333
2019-03-07,10,3.000000,8.000000,4,4,62.291667
2019-04-07,11,3.508197,10.000000,1,5,68.750000
2019-05-07,11,4.000000,7.000000,2,0,75.000000
2019-06-07,11,4.000000,7.000000,0,0,96.000000
2019-07-07,12,4.000000,6.508197,0,0,80.000000
2019-08-07,12,10.000000,6.000000,2,0,90.000000
2019-09-07,12,2.000000,8.000000,2,4,60.000000
2019-10-07,12,6.000000,9.000000,1,0,85.000000

In [ ]:
df.interpolate(method='index') # fill the nan valu use index our index valu is Date

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.000000,9.000000,3,5,50.000000
2019-02-07,10,6.000000,8.474576,4,0,56.458333
2019-03-07,10,3.000000,8.000000,4,4,62.291667
2019-04-07,11,3.508197,10.000000,1,5,68.750000
2019-05-07,11,4.000000,7.000000,2,0,75.000000
2019-06-07,11,4.000000,7.000000,0,0,96.000000
2019-07-07,12,4.000000,6.508197,0,0,80.000000
2019-08-07,12,10.000000,6.000000,2,0,90.000000
2019-09-07,12,2.000000,8.000000,2,4,60.000000
2019-10-07,12,6.000000,9.000000,1,0,85.000000

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'], index_col= 'Class')
df

,Date,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Class,,,,,,
10,2019-01-07,2.0,9.0,3,5,50.0
10,2019-02-07,6.0,NaN,4,0,NaN
10,2019-03-07,3.0,8.0,4,4,NaN
11,2019-04-07,NaN,10.0,1,5,NaN
11,2019-05-07,4.0,7.0,2,0,75.0
11,2019-06-07,NaN,7.0,0,0,96.0
12,2019-07-07,4.0,NaN,0,0,80.0
12,2019-08-07,10.0,6.0,2,0,90.0
12,2019-09-07,2.0,8.0,2,4,60.0
12,2019-10-07,6.0,9.0,1,0,85.0

In [ ]:
df.interpolate(method='index') # fill the nan valu use index our index valu is Class

,Date,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Class,,,,,,
10,2019-01-07,2.0,9.0,3,5,50.0
10,2019-02-07,6.0,8.0,4,0,50.0
10,2019-03-07,3.0,8.0,4,4,50.0
11,2019-04-07,4.0,10.0,1,5,96.0
11,2019-05-07,4.0,7.0,2,0,75.0
11,2019-06-07,4.0,7.0,0,0,96.0
12,2019-07-07,4.0,9.0,0,0,80.0
12,2019-08-07,10.0,6.0,2,0,90.0
12,2019-09-07,2.0,8.0,2,4,60.0
12,2019-10-07,6.0,9.0,1,0,85.0

In [ ]:
df.interpolate(method='nearest') # fill the nan valu use nearest

,Date,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Class,,,,,,
10,2019-01-07,2.0,9.0,3,5,50.0
10,2019-02-07,6.0,9.0,4,0,50.0
10,2019-03-07,3.0,8.0,4,4,50.0
11,2019-04-07,4.0,10.0,1,5,75.0
11,2019-05-07,4.0,7.0,2,0,75.0
11,2019-06-07,4.0,7.0,0,0,96.0
12,2019-07-07,4.0,6.0,0,0,80.0
12,2019-08-07,10.0,6.0,2,0,90.0
12,2019-09-07,2.0,8.0,2,4,60.0
12,2019-10-07,6.0,9.0,1,0,85.0

In [ ]:
df = pd.read_csv('Student_2.csv', parse_dates= ['Date'], index_col= 'Date')
df

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.0,9.0,3,5,50.0
2019-02-07,10,6.0,NaN,4,0,NaN
2019-03-07,10,3.0,8.0,4,4,NaN
2019-04-07,11,NaN,10.0,1,5,NaN
2019-05-07,11,4.0,7.0,2,0,75.0
2019-06-07,11,NaN,7.0,0,0,96.0
2019-07-07,12,4.0,NaN,0,0,80.0
2019-08-07,12,10.0,6.0,2,0,90.0
2019-09-07,12,2.0,8.0,2,4,60.0
2019-10-07,12,6.0,9.0,1,0,85.0

In [ ]:
df.interpolate(method='polynomial', order = 1)

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.000000,9.000000,3,5,50.000000
2019-02-07,10,6.000000,8.474576,4,0,56.458333
2019-03-07,10,3.000000,8.000000,4,4,62.291667
2019-04-07,11,3.508197,10.000000,1,5,68.750000
2019-05-07,11,4.000000,7.000000,2,0,75.000000
2019-06-07,11,4.000000,7.000000,0,0,96.000000
2019-07-07,12,4.000000,6.508197,0,0,80.000000
2019-08-07,12,10.000000,6.000000,2,0,90.000000
2019-09-07,12,2.000000,8.000000,2,4,60.000000
2019-10-07,12,6.000000,9.000000,1,0,85.000000

In [ ]:
df.interpolate(method='polynomial', order = 2)

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.000000,9.000000,3,5,50.000000
2019-02-07,10,6.000000,7.260492,4,0,42.595317
2019-03-07,10,3.000000,8.000000,4,4,44.207942
2019-04-07,11,2.929427,10.000000,1,5,55.183438
2019-05-07,11,4.000000,7.000000,2,0,75.000000
2019-06-07,11,2.522144,7.000000,0,0,96.000000
2019-07-07,12,4.000000,6.266125,0,0,80.000000
2019-08-07,12,10.000000,6.000000,2,0,90.000000
2019-09-07,12,2.000000,8.000000,2,4,60.000000
2019-10-07,12,6.000000,9.000000,1,0,85.000000

In [ ]:
df.interpolate(method='spline', order = 2)

,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
Date,,,,,,
2019-01-07,10,2.000000,9.000000,3,5,50.000000
2019-02-07,10,6.000000,8.805620,4,0,44.227837
2019-03-07,10,3.000000,8.000000,4,4,46.397532
2019-04-07,11,4.291173,10.000000,1,5,56.962777
2019-05-07,11,4.000000,7.000000,2,0,75.000000
2019-06-07,11,4.286787,7.000000,0,0,96.000000
2019-07-07,12,4.000000,7.280628,0,0,80.000000
2019-08-07,12,10.000000,6.000000,2,0,90.000000
2019-09-07,12,2.000000,8.000000,2,4,60.000000
2019-10-07,12,6.000000,9.000000,1,0,85.000000

In [ ]:
# VIDEO 30 DONE

In [181]:
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [182]:
df.interpolate() # fill missing valu defolt liniarly

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [183]:
df.dtypes

Date             object
Class             int64
Study hrs       float64
Sleeping hrs    float64
Social Media      int64
Mobile Game       int64
Percantege      float64
dtype: object

In [184]:
df.interpolate(limit= 1) # fill only 1 nan valu

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,3.5,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [185]:
df.interpolate(limit= 2) # fill only 2 nan valu

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [187]:
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [188]:
df.interpolate(limit = 1, limit_direction= 'backward') # fill the valu fro backward

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [189]:
df.interpolate(limit = 1, limit_direction= 'both') # fill 1 valu from forward and fill 1 valu from backward becouse of both

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [191]:
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [190]:
df.interpolate(limit_area= 'inside')

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [192]:
df.interpolate(limit_area= 'outside')

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [193]:
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.0
1,2/7/2019,10,6.0,NaN,4,0,NaN
2,3/7/2019,10,3.0,8.0,4,4,NaN
3,4/7/2019,11,NaN,10.0,1,5,NaN
4,5/7/2019,11,4.0,7.0,2,0,75.0
5,6/7/2019,11,NaN,7.0,0,0,96.0
6,7/7/2019,12,4.0,NaN,0,0,80.0
7,8/7/2019,12,10.0,6.0,2,0,90.0
8,9/7/2019,12,2.0,8.0,2,4,60.0
9,10/7/2019,12,6.0,9.0,1,0,85.0

In [195]:
df.interpolate(inplace= True) # do not create new data Frame
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [196]:
df

,Date,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1/7/2019,10,2.0,9.0,3,5,50.00
1,2/7/2019,10,6.0,8.5,4,0,56.25
2,3/7/2019,10,3.0,8.0,4,4,62.50
3,4/7/2019,11,3.5,10.0,1,5,68.75
4,5/7/2019,11,4.0,7.0,2,0,75.00
5,6/7/2019,11,4.0,7.0,0,0,96.00
6,7/7/2019,12,4.0,6.5,0,0,80.00
7,8/7/2019,12,10.0,6.0,2,0,90.00
8,9/7/2019,12,2.0,8.0,2,4,60.00
9,10/7/2019,12,6.0,9.0,1,0,85.00

In [198]:
# VIDEO 31 DONE

In [199]:
# Pandas Loc
# Syntax : DataFrame.loc[]

In [200]:
df = pd.read_csv('Student_1.csv')
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [201]:
df.loc[0] # Print The 0 level of all row with col name

Student ID      1001
Class             10
Study hrs          2
Sleeping hrs       9
Social Media       3
Mobile Game        5
Percantege        50
Name: 0, dtype: int64

In [202]:
df.loc[9] # Print The 9 level of all row with col name

Student ID      1010
Class             12
Study hrs          6
Sleeping hrs       9
Social Media       1
Mobile Game        0
Percantege        85
Name: 9, dtype: int64

In [203]:
df.loc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80

In [204]:
df.loc[[2,4]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
2,1003,10,3,8,4,4,60
4,1005,11,4,7,2,0,75

In [205]:
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [207]:
df.loc[4,'Class'] # print 4th item of Class col

11

In [208]:
df.loc[0:3, 'Class']

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [209]:
df.loc[0:3, 'Percantege']

0    50
1    80
2    60
3    45
Name: Percantege, dtype: int64

In [211]:
#df.loc[[False, False, True]]

In [213]:
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [212]:
df.loc[df['Class'] < 11 ]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60

In [214]:
df.loc[df['Class'] < 11, ['Percantege'] ]

   Percantege
0          50
1          80
2          60

In [215]:
# PANDAS I LOC
# Syntax : DataFrame.iloc[]

In [216]:
df.iloc[0]

Student ID      1001
Class             10
Study hrs          2
Sleeping hrs       9
Social Media       3
Mobile Game        5
Percantege        50
Name: 0, dtype: int64

In [217]:
df.iloc[[0]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50

In [218]:
df.iloc[:,0] # all row of 1st col

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [220]:
# df.loc[:,0] # all row of 1st col /// if i use only loc it will show error

In [221]:
df.iloc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80

In [224]:
# VIDEO 32 DONE

In [225]:
# Pandas Groupby
# Syntax : DataFrame.groupby()

In [226]:
df = pd.read_csv('Student_1.csv')
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [231]:
gr1 = df.groupby(by = 'Class')
gr1

In [232]:
gr1.groups

{10: [0, 1, 2], 11: [3, 4, 5], 12: [6, 7, 8, 9]}

In [233]:
gr1 = df.groupby(['Social Media', 'Class']).groups
gr1

{(0, 11): [5], (0, 12): [6], (1, 11): [3], (1, 12): [9], (2, 11): [4], (2, 12): [7, 8], (3, 10): [0], (4, 10): [1, 2]}

In [234]:
for Section, df_1 in gr1:
    print(Section)
    print(df_1)

0
11
0
12
1
11
1
12
2
11
2
12
3
10
4
10

In [235]:
list(gr1)

[(0, 11), (0, 12), (1, 11), (1, 12), (2, 11), (2, 12), (3, 10), (4, 10)]

In [236]:
dict(gr1)

{(0, 11): Int64Index([5], dtype='int64'),
 (0, 12): Int64Index([6], dtype='int64'),
 (1, 11): Int64Index([3], dtype='int64'),
 (1, 12): Int64Index([9], dtype='int64'),
 (2, 11): Int64Index([4], dtype='int64'),
 (2, 12): Int64Index([7, 8], dtype='int64'),
 (3, 10): Int64Index([0], dtype='int64'),
 (4, 10): Int64Index([1, 2], dtype='int64')}

In [237]:
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [238]:
df.groupby('Class').get_group(10)

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,4,0,80
2,1003,10,3,8,4,4,60

In [239]:
df.groupby('Social Media').get_group(2)

,Student ID,Class,Study hrs,Sleeping hrs,Social Media,Mobile Game,Percantege
4,1005,11,4,7,2,0,75
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60

In [241]:
gr1

{(0, 11): [5], (0, 12): [6], (1, 11): [3], (1, 12): [9], (2, 11): [4], (2, 12): [7, 8], (3, 10): [0], (4, 10): [1, 2]}

In [245]:
# Video 33 done